test/tests/multiapps/temperature_set_on_openfoam_boundary/par/buoyantCavity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
500
(
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
...
)
;

boundaryField
{
    patch0
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
100
(
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
...
)
;
    }
    patch1
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0.153914670285303;
    }
    patch2
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
50
(
0.119587048204266
0.130975708801998
0.142364900879329
0.15375323878834
0.165142184108845
0.17653071184759
0.187918954878114
0.199306875249022
...
)
;
    }
    patch3
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
50
(
0.16161040381121
0.177001870833919
0.192393337856629
0.20778480489389
0.2231762719166
0.238567738953861
0.253959205976571
0.269350673013832
...
)
;
    }
    patch4
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
50
(
0.227777008374687
0.227775489984197
0.227773465492646
0.227771947160363
0.22777093492914
0.227769416625961
0.227767392236274
0.227766380063258
...
)
;
    }
    patch5
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
100
(
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
0.16161040381121
...
)
;
    }
}


// ************************************************************************* //
